# Домашнее задание: прорешайте еще раз индивидуально все задания, которые решали в классе.
#
#     - [х] в выбранных вариантах проставьте х или пропишите решение, если вариантов ответа не предусмотрено


# ---- ДАННЫЕ И ПЕРЕМЕННЫЕ ----

# Задание 1. Что представляет собой переменная в Python?
#     - [ ] хранилище данных
#     - [ ] ничего из перечисленного
#     - [ ] и ссылка, и хранилище данных
#     - [x] ссылка на объект в памяти
#
# Задание 2. Что делает оператор присваивания (=)?
#     - [ ] создает переменную, если ее ранее не было
#     - [ ] связывает переменную с данными
#     - [ ] обнуляет значение переменной
#     - [x] заносит данные в переменную
#     - [ ] удаляет переменную с указанным именем
#
# Задание 3. Какая типизация реализована в Python? Отметьте все верные варианты.
#     - [ ] строгая типизация
#     - [x] динамическая типизация
#     - [ ] нестрогая типизация
#     - [ ] статическая типизация
#
# Задание 4. Что происходит при присваивании одной переменной другой (a = b)?
#     - [ ] создаются две переменные, если они до этого не существовали, с нулевыми значениями
#     - [ ] такая операция недопустима: можно присваивать только объекты, а не переменные
#     - [x] копирование данных и переменная a будет содержать копию информации из переменной b
#     - [ ] копирование ссылки и обе переменные ссылаются на один и тот же объект
#
# Задание 5. Как называется присваивание вида a = b = c = 0?
#     - [x] цепным присваиванием
#     - [ ] каскадным присваиванием
#     - [ ] такая операция недопустима
#     - [ ] множественным присваиванием
#     - [ ] унитарным присваиванием
#
# Задание 6. Как называется присваивание вида a, b = 1, 2?
#     - [ ] каскадным присваиванием
#     - [ ] унитарным присваиванием
#     - [ ] цепным присваиванием
#     - [ ] такая операция недопустима
#     - [x] множественным присваиванием
#
# Задание 7. Для чего используется функция type?
#     - [ ] для определения типа объекта, но не переменной
#     - [ ] для определения типа переменной, но не объекта
#     - [х] для определения типа переменной или объекта
#     - [ ] такой функции в языке Python нет
#
# Задание 8. Выберите только правильные имена переменных.
#     - [ ] \n
#     - [ ] 7_b
#     - [х] var_a
#     - [х] S
#     - [х] _b
#     - [х] __arg_c__
#     - [х] d25
#     - [ ] don't
#     - [ ] 25d
#     - [х] TT1
#
# Задание 9. Различаются ли имена переменных arg, Arg, ARG?
#     - [х] да
#     - [ ] нет
#     - [ ] такие имена недопустимы
#     - [ ] иногда
#
# Задание 10. Выберите верные варианты присвоения данных переменной b
# (считается, что других переменных в программе нет).
#     - [х] b = "hello"
#     - [х] b = "True"
#     - [ ] "abc" = b
#     - [ ] 5 = b
#     - [ ] False = b
#     - [х] b = 5.8
#     - [ ] b = hello
#
# Задание 11. Что произойдет, если функции type присвоить число 7 (type = 7)?
#     - [ ] операция будет просто проигнорирована и программа продолжит выполняться дальше
#     - [ ] функция type возвратит тип числа 7
#     - [x] число 7 станет синонимом функции type
#     - [ ] произойдет ошибка, так как type - это встроенная функция языка Python
#     - [ ] переменная type будет ссылаться на число 7

# Задание 12. Придумайте и запишите напротив названия переменным, в которых будут храниться:
High ='высота'
Widht = 'ширина'
Goods_Cost = "стоимость товара"
Age = "возраст"
Fail_Error = "сообщение об ошибке"
Congrats = "сообщение об успехе"
Number_Of_Students = "количество студентов"
Username = "имя пользователя"
AvDayTemp = "Средняя температура за день"
Total_Sale = "Общий объем продаж за месяц"
Counter_View = "Количество просмотров видео"
user_email = "Электронный адрес пользователя"
free_places = "Количество доступных мест в аудитории"
Carrying_capacity = "Максимальная грузоподъемность лифта"
task_procent = "Процент выполнения задачи"
Feedback = "Оценка пользователя после обслуживания"
Queue_Time = "Суммарное время ожидания в очереди"
Number_of_pages = "Число страниц в документе"
print (Number_of_pages)

# ---- ЧИСЛА И ОПЕРАЦИИ НАД НИМИ ----

# Задание 1. К какому типу данных относится числовой тип int?
#     - [ ] комплексному
#     - [ ] такой тип данных не существует
#     - [ ] вещественному
#     - [x] целочисленному
#
# Задание 2. К какому типу данных относится числовой тип float?
#     - [ ] целочисленному
#     - [ ] комплексному
#     - [ ] такой тип данных не существует
#     - [x] вещественному
#
# Задание 3. Какой тип данных отобразит команда print(type(-36))?
#     - [ ] complex
#     - [ ] bool
#     - [ ] float
#     - [ ] str
#     - [x] int
#
# Задание 4. Какой тип данных отобразит команда print(type(3.67))?
#     - [ ] str
#     - [ ] int
#     - [x] float
#     - [ ] complex
#     - [ ] bool
#
# Задание 5. Поставьте соответствия между арифметическими операторами и их названиями.
#     - [ ] целочисленное деление
#     - [ ] возведение в степень
#     - [ ] остаток от деления
#     - [ ] деление
# Не понял задание
# Задание 6. Какое значение мы увидим при выполнении в консоли команды 7.0 + 2.5?
#     - [х] 9.5
#     - [ ] 9,5
#
# Задание 7. Какое значение будет получено при вычислении 2 ** 4? 16
print (2**4)
#Задание 8. Какое значение будет получено при вычислении (32 / 2 ** 4) 2.0
print (32 / 2 ** 4)
# Задание 9. Какое значение будет получено при вычислении 11 % 3? 2
print (11 % 3) #2
# Задание 10. Какое значение будет получено при вычислении 11 % 33?
print (11 % 33) # 11
# Задание 11. Какой будет результат при выполнении команды 21 // 4?
print (21 // 4) # 5
# Задание 12. Какой будет порядок выполнения операций 3 + 5 * 9 // 4 ** (2 - 1)?
# 2-1=1
# 4 ** 1 = 4
# 5 * 9 = 45
# 45 // 4 = 11
print (45//4)
# (45//4) + 3 = 11
# Проверка:
print (3 + 5 * 9 // 4 ** (2 - 1))
# 11=11
#
# Задание 13. Какой тип данных мы увидим, выполнив строчку print(type(8/2))?
#     - [x] float
#     - [ ] int
#     - [ ] complex
#     - [ ] str
print(type(8/2))
#
# Задание 14. Чему будет равно итоговое значение переменной i при выполнении программы:
i = 2
i += 3
print(i)
# 5
# Задание 15. Чему будет равно итоговое значение переменной k при выполнении программы:
k = 8
k *= 2
print(k)
# по идее 16
# Задание 16. Допишите текст программы для вычисления модуля введенного с клавиатуры числа
# в переменную d и вывода значения в консоль с помощью функции print.
#   Например, ввод:
#   -5
#   Вывод:
#   5
d = int (input ("Input d: "))
print ("d =", end=" ")
print (abs(-d))
# ---- ФУНКЦИИ PRINT(), INPUT() ----

# Задание 1. В программе определите три следующие переменные:
#   a = 7
#   b = -4
#   c = 3
#   Выведите в консоль их значения, используя одну функцию print
#   (между значениями переменных должен стоять один пробел):
#   7 -4 3
#
a = 7
b = -4
c = 3
print (a,b,c)
#   7 -4 3
#
# Задание 2. В программе определите три следующие переменные:
#   a = 7
#   b = -4
#   c = 3
####!!!!!!! они уже определены!!!!!!#####
#   Выведите в консоль их значения в столбик (каждое новое значение отображается с новой строчки),
#   используя одну функцию print.
#   7
#   -4
#   3
print (a)
print(b)
print(c)
#
# Задание 3. В программе определите две следующие строки:
#   s1 = "Hello"
#   s2 = "Berlin"
#   С помощью двух функций print (каждая отображает соответствующую строку) отобразите строки в консоли так,
#   чтобы они шли друг за другом через пробел.
#   Hello Berlin
#
s1 = "Hello"
s2 = "Berlin"
s3 =" - High;) from Berlin"
print(s1,s2)
print (s3)



# Задание 4. Допишите программу, в которой вводятся два слова (в переменные s1 и s2) в одну строчку через пробел,
#   и отображаются в консоли в формате:
#   Word 1: s1 | Word 2: s2
#   Например, ввод:
#   I love
#   Вывод:
#   Word 1: I | Word 2: love
#s1 = input ("Введите I")
#s2 = input ("Введите Love")
#print ("Word 1:", s1, "Word 2:", s2, sep="|")
# !!!!! Доделать через END!!!!!
s1 = input ("Введите I")
s2 = input ("Введите Love")
print ("Word 1:", end=" ")
print (s1, "Word 2:", sep=" | ", end=" ")
print (s2)
# Работает, но как то через жопу.


# Задание 5. Напишите программу, в которой вводятся два целых положительных числа и
#   в консоль выводится результат возведения первого числа в степень второго.
#   Например, ввод:
#   2 3
#   Вывод:
#   8

#потратил сука два часа, чтобы понять, что нужно было оттайпировать цифру,
# указать, что число целое int или дробное float
a = int (input ("input a: "))
b = int (input ("input b: "))
c = pow(a, b)
print (c)

a = float (input ("input a.-: "))
b = float (input ("input b.-: "))
c = pow(a, b)
print (c)

# Задание 6. Выберите команду, которая позволяет сохранять одно целое введенное с клавиатуры число.
#     - [x] d = int(input())
#     - [ ] такой команды не существует
#     - [ ] d = input()
#     - [ ] d = float(input())
#
# Задание 7. Выберите команду, которая позволяет сохранять строку, введенную с клавиатуры.
#     - [ ] d = float(input())
#     - [ ] d = int(input())
#     - [х] d = input()
#     - [ ] такой команды не существует
#
# Задание 8. Напишите программу, которая принимает на вход два вещественных числа в одну строку через пробел
# и выводит на экран их сумму.
#   Например, ввод:
#   8 11
#   Вывод:
#   19.0
a, b = map(float, input("Введите два числа, разделенных пробелом: ").split())
c = (a+b)
print (c)
# сделал при помощи жипити


#
# Задание 9. Вводятся длина и ширина прямоугольника (каждое вещественное значение с новой строки).
# Необходимо вычислить его периметр (сумму длин сторон) и результат вывести на экран.
#   Например, ввод:
#   8
#   11
#   Вывод:
#   38.0
a = float(input ("Введите Ширину:"))
b = float(input ("Введите Длину:"))
c = (2*(a+b))
print ("Периметр Прямоугольника:", c)
#
# Задание 10. Напишите программу вывода переменной math.pi с точностью до тысячных (три знака после запятой).
#   Вывод:
#   3.142
import math

print (math.pi)
pi=round(math.pi,3)
print (pi)
# Не знал, как сделать обращался к жпт, насколько я понял надо всегда импортировать math!

# Задание 11. Составить программу вывода на экран вещественного числа, вводимого с клавиатуры.
# Выводимому числу должно предшествовать сообщение "Вы ввели число" (без кавычек).
#   Например, ввод:
#   7.54
#   Вывод:
#   Вы ввели число 7.54
#
c = float (input ("Введите число: "))
print ("Вы ввели", c)

# Задание 12. Напишите программу, которая запрашивает число и выводит его абсолютное (положительное) значение:
#   Введите число:
#   Абсолютное значение:
#
c = int (input ("Введите число: "))
abs(c) # Почему не поменялась переменная?
print ("Вы ввели", c) #так почему то не работает
print ("Вы ввели", (abs(c)))

# Задание 13. Напишите программу, которая запрашивает последовательно два числа,
# а потом показывает сумму этих двух чисел.
#   Введите число 1:
#   Введите число 2:
#   Результат сложения:
a = int (input("Введите число 1 "))
b = int (input("Введите число 2 "))
c = a + b
print ("Результат сложения:",c)

# Задание 14. Напишите программу, которая запрашивает последовательно два числа,
# а потом показывает меньшее из двух чисел.
#   Введите число 1:
#   Введите число 2:
#   Меньшее число:
#
a = int (input("Введите число 1: "))
b = int (input("Введите число 2: "))
print ("Меньшее число:",min(a,b))
# Задание 15. Напишите программу, которая запрашивает последовательно два числа,
# а потом показывает большее из двух чисел.
#   Введите число 1:
#   Введите число 2:
#   Большее число:
#
a = int (input("Введите число 1: "))
b = int (input("Введите число 2: "))
print ("Большее число:",max(a,b))
# Задание 16. Напишите программу, которая запрашивает последовательно дробное число, количество знаков после запятой,
# а потом показывает округленное число до этих знаков.
#   Введите дробное число:
#   До скольких знаков нужно округлить:
#   Округленное число:
#
a = float (input("Введите дробное число: "))
b = int (input("До скольких знаков нужно округлить: "))
c = (round(a,b))
print (c)
print ("done!!!")