# Тема: Итераторы и генераторы. Функции-генераторы. Выражения-генераторы

# Задание 1: Напишите функцию, которая создает итератор, возвращающий числа от 1 до заданного числа `n`.
# Обработайте исключение StopIteration


# Задание 2: Напишите выражение-генератор, которое возвращает квадраты чисел от 0 до 10.
# Обработайте исключение StopIteration


# Задание 3: Напишите функцию-генератор, которая принимает предложение и возвращает слова по одному.
# Обработайте исключение StopIteration


def one_word(sentence):
    for word in sentence.split():
        yield word

sentence = "Hello, world!"
word = one_word(sentence)
while True:
    try:
        print(next(word))
    except StopIteration:
        print("End of sentence")
        break
